In [7]:
import numpy as np
import pandas as pd
a=np.array([['Николай','15','10И','География'],['Надежда','16','10И','Криптография']])
b=pd.DataFrame(a,columns=['name','age','class','hobby'])
b

      name age class         hobby
0  Николай  15   10И     География
1  Надежда  16   10И  Криптография

In [8]:
c=b.drop(['hobby'],axis=1)
c

      name age class
0  Николай  15   10И
1  Надежда  16   10И